**ИНТЕРАКТИВНЫЙ ТРЕНАЖЕР ПО SQL. ОСНОВЫ РЕЛЯЦИОННОЙ МОДЕЛИ И SQL.**

[Курс](https://stepik.org/course/63054/syllabus) на Stepik.

Автор: **Озерова Галина Павловна**  
<img src="imgs/ozerova.JPG" title="Озерова Галина Павловна" width="200" height="200"/>

Конспектировал: **Илья Филимонов** (GiHub: [@IsFilimonov](https://github.com/IsFilimonov))  

<img src="imgs/IsFilimonov.png" title="Илья Филимонов" width="200" height="200"/>

---

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Введение" data-toc-modified-id="Введение-1"><strong>Введение</strong></a></span><ul class="toc-item"><li><span><a href="#От-конспектирующего" data-toc-modified-id="От-конспектирующего-1.1">От конспектирующего</a></span></li><li><span><a href="#Памятка-о-типичных-ошибках-и-способах-их-исправления" data-toc-modified-id="Памятка-о-типичных-ошибках-и-способах-их-исправления-1.2">Памятка о типичных ошибках и способах их исправления</a></span></li></ul></li><li><span><a href="#Основные-понятия-реляционных-баз-данных" data-toc-modified-id="Основные-понятия-реляционных-баз-данных-2"><strong>Основные понятия реляционных баз данных</strong></a></span><ul class="toc-item"><li><span><a href="#1.6-Таблица-&quot;Командировки&quot;,-запросы-на-выборку" data-toc-modified-id="1.6-Таблица-&quot;Командировки&quot;,-запросы-на-выборку-2.1"><strong>1.6 Таблица "Командировки", запросы на выборку</strong></a></span><ul class="toc-item"><li><span><a href="#Структура-и-наполнение-таблицы" data-toc-modified-id="Структура-и-наполнение-таблицы-2.1.1">Структура и наполнение таблицы</a></span></li><li><span><a href="#Задание-1" data-toc-modified-id="Задание-1-2.1.2">Задание 1</a></span></li><li><span><a href="#Задание-2" data-toc-modified-id="Задание-2-2.1.3">Задание 2</a></span></li><li><span><a href="#Задание-3" data-toc-modified-id="Задание-3-2.1.4">Задание 3</a></span></li><li><span><a href="#Задание-4" data-toc-modified-id="Задание-4-2.1.5">Задание 4</a></span></li><li><span><a href="#Задание-5" data-toc-modified-id="Задание-5-2.1.6">Задание 5</a></span></li><li><span><a href="#Задание-6" data-toc-modified-id="Задание-6-2.1.7">Задание 6</a></span></li><li><span><a href="#Задание-7" data-toc-modified-id="Задание-7-2.1.8">Задание 7</a></span></li><li><span><a href="#Задание-8" data-toc-modified-id="Задание-8-2.1.9">Задание 8</a></span></li><li><span><a href="#Задание-9" data-toc-modified-id="Задание-9-2.1.10">Задание 9</a></span></li><li><span><a href="#Задание-10" data-toc-modified-id="Задание-10-2.1.11">Задание 10</a></span></li></ul></li></ul></li></ul></div>

# **Введение**

## От конспектирующего
(Не реклама): сам курс использует диалект MySQL, но мне комфортнее использовать PostgreSQL 12.6 ([download](https://www.postgresql.org/download/)).  
[Рекомендации](https://wiki.postgresql.org/wiki/Don%27t_Do_This) того, чего не нужно делать в Postgres.

Для работы с базой лично я использую IDE [DataGrip](https://www.jetbrains.com/ru-ru/datagrip/) (платная) или [Dbeaver](https://dbeaver.io/) (бесплатная) - под MacOS. 

Это всё сторонние решения, но можно воспользоваться более [простым способом](https://towardsdatascience.com/heres-how-to-run-sql-in-jupyter-notebooks-f26eb90f3259) - использовать Jupyter Notebook в роли SQL IDE. Для этого нам потребуется установить несколько библиотек. Для работы с Jupyter Notebook я использую платформу [Anaconda](https://www.anaconda.com/), поэтому все нужные библиотеки для работы я буду устанавливать именно в эту среду. Я не буду останавливаться на деталях в вопросе "как?", чтобы в деталях не закопаться. В интернете полно подсказок. Главное, должны быть установлены:
- `ipython-sql` - [пакет](https://anaconda.org/conda-forge/ipython-sql) для работы с SQL запросами;
- `psycopg2` или `psycopg2-binary` - драйвер базы данных Postgres. Там есть нюансы с установкой;
- `sqlalchemy` - ORM для работы с SQL БД.


Более подробно читайте [статью](https://towardsdatascience.com/heres-how-to-run-sql-in-jupyter-notebooks-f26eb90f3259), которая была выше.

Для установки соединения с БД мы единожды используем SQL Alchemy.

In [1]:
import sqlalchemy

Далее создаем соединение.

In [2]:
sqlalchemy.create_engine("postgresql://localhost:5432/postgres")

Engine(postgresql://localhost:5432/postgres)

Загружаем extension.

In [3]:
%load_ext sql

Проверяем соединение.

In [4]:
%sql postgresql://localhost:5432/postgres

'Connected: @postgres'

Чтобы узнать какая версия установлена у вас, введите в консоле запроса БД (не в командной строке, а в ячейке):

In [5]:
%%sql

SELECT version();

 * postgresql://localhost:5432/postgres
1 rows affected.

[('PostgreSQL 12.6 on x86_64-apple-darwin16.7.0, compiled by Apple LLVM version 8.1.0 (clang-802.0.42), 64-bit',)]

Вероятнее всего у вас уже создана БД `postgres`. Будем работать с ней. В БД нам нужно создать схему `stepik`, так сказать группировку (семантическую) для нужных нам таблиц. 

`DROP SCHEMA ... CASCADE` удаляет схему со всеми данными внутри.  
`IF NOT EXISTS` означает не делать ничего (только выдать замечание), если схема с таким именем уже существует.

In [6]:
%%sql
DROP SCHEMA IF EXISTS stepik CASCADE;

CREATE SCHEMA IF NOT EXISTS stepik;

 * postgresql://localhost:5432/postgres
Done.
Done.

[]

## Памятка о типичных ошибках и способах их исправления

1. Приведите синтаксис запроса к общепринятому:
    - если у вас есть время, стоит изучить [руководство по стилю SQL](https://www.sqlstyle.guide/ru/);
    - можете отформатировать ваш запрос с помощью сторонних [сервисов](https://codebeautify.org/sqlformatter).
2. Проверьте, что **ключевые слова**, **названия столбцов** и **значения в ячейках**, которые необходимо найти, написаны правильно. Особенно обратите внимание, чтобы в русских названиях столбцов не было английских букв.
3. Проверьте, что:
    - количество открывающихся скобок равно количеству закрывающихся;
    - запятые разделяют перечисление столбцов, но не ключевые слова;
    - запросы разделяются точкой с запятой.
4. Последовательность написания команд SQL:
```SQL
SELECT 'столбцы или * для выбора всех столбцов; обязательно'
FROM 'таблица; обязательно'
WHERE 'условие/фильтрация, например, city = 'Moscow'; необязательно'
GROUP BY 'столбец, по которому хотим сгруппировать данные; необязательно'
HAVING 'условие/фильтрация на уровне сгруппированных данных; необязательно'
ORDER BY 'столбец, по которому хотим отсортировать вывод; необязательно'
```
5. Если запрос включает подзапросы, выполните сначала подзапросы и удостоверьтесь, что получаете ожидаемый результат.
6. **Важно!** На платформе Stepik используется MySQL, версия 8.0.21.
7. Последовательность выполнения команд SQL:
<center><img src="imgs/sql-order.jpeg" title="SQL order" width="30%" height="30%"/></center>
8. Или другой вариант от [@Ken Flerlage](https://www.flerlagetwins.com/) со сравнением ([источник](https://www.flerlagetwins.com/2018/10/sql-part4.html)):
<center><img src="imgs/sql-order-operations.png" title="SQL order operations" width="50%" height="50%"/></center>
9. Специфические отличия MySQL от PostgreSQL:

[MySQL](https://www.mysqltutorial.org/mysql-having.aspx/): `FROM` => `WHERE` = `SELECT` = `GROUP BY` = `HAVING` = `ORDER BY` = `LIMIT`.   

[PostgreSQL](https://www.postgresqltutorial.com/postgresql-having/): `FROM` => `WHERE` = `GROUP BY` = `HAVING` = `SELECT` = `DISTINCT` = `ORDER BY` = `LIMIT`.

# **Основные понятия реляционных баз данных**

## **1.6 Таблица "Командировки", запросы на выборку**

### Структура и наполнение таблицы

Таблица `trip`, в которой представлена информация о командировках сотрудников некоторой организации (фамилия сотрудника, город, куда он ездил, размер суточных, даты первого и последнего дня командировки):

```mysql
CREATE TABLE trip
(
    trip_id    INT PRIMARY KEY AUTO_INCREMENT,
    name       VARCHAR(30),
    city       VARCHAR(25),
    per_diem   DECIMAL(8, 2),
    date_first DATE,
    date_last  DATE
);

INSERT INTO trip
VALUES ("1", "Баранов П.Е.", "Москва", "700", "2020-01-12", "2020-01-17"),
       ("2", "Абрамова К.А.", "Владивосток", "450", "2020-01-14", "2020-01-27"),
       ("3", "Семенов И.В.", "Москва", "700", "2020-01-23", "2020-01-31"),
       ("4", "Ильиных Г.Р.", "Владивосток", "450", "2020-01-12", "2020-02-02"),
       ("5", "Колесов С.П.", "Москва", "700", "2020-02-01", "2020-02-06"),
       ("6", "Баранов П.Е.", "Москва", "700", "2020-02-14", "2020-02-22"),
       ("7", "Абрамова К.А.", "Москва", "700", "2020-02-23", "2020-03-01"),
       ("8", "Лебедев Т.К.", "Москва", "700", "2020-03-03", "2020-03-06"),
       ("9", "Колесов С.П.", "Новосибирск", "450", "2020-02-27", "2020-03-12"),
       ("10", "Семенов И.В.", "Санкт-Петербург", "700", "2020-03-29", "2020-04-05"),
       ("11", "Абрамова К.А.", "Москва", "700", "2020-04-06", "2020-04-14"),
       ("12", "Баранов П.Е.", "Новосибирск", "450", "2020-04-18", "2020-05-04"),
       ("13", "Лебедев Т.К.", "Томск", "450", "2020-05-20", "2020-05-31"),
       ("14", "Семенов И.В.", "Санкт-Петербург", "700", "2020-06-01", "2020-06-03"),
       ("15", "Абрамова К.А.", "Санкт-Петербург", "700", "2020-05-28", "2020-06-04"),
       ("16", "Федорова А.Ю.", "Новосибирск", "450", "2020-05-25", "2020-06-04"),
       ("17", "Колесов С.П.", "Новосибирск", "450", "2020-06-03", "2020-06-12"),
       ("18", "Федорова А.Ю.", "Томск", "450", "2020-06-20", "2020-06-26"),
       ("19", "Абрамова К.А.", "Владивосток", "450", "2020-07-02", "2020-07-13"),
       ("20", "Баранов П.Е.", "Воронеж", "450", "2020-07-19", "2020-07-25");
SELECT *
FROM trip;
```

In [7]:
%%sql
SHOW LC_COLLATE;

 * postgresql://localhost:5432/postgres
1 rows affected.

[('en_US.UTF-8',)]

In [8]:
%%sql
SHOW LC_CTYPE;

 * postgresql://localhost:5432/postgres
1 rows affected.

[('en_US.UTF-8',)]

In [9]:
%%sql
DROP TABLE IF EXISTS stepik.trip CASCADE;

CREATE TABLE stepik.trip
(
    trip_id    BIGSERIAL,
    name       text COLLATE "C",
    city       text COLLATE "C",
    per_diem   DECIMAL(8, 2),
    date_first DATE,
    date_last  DATE
);

INSERT INTO stepik.trip(name, city, per_diem, date_first, date_last)
VALUES ('Баранов П.Е.', 'Москва', '700', '2020-01-12', '2020-01-17'),
       ('Абрамова К.А.', 'Владивосток', '450', '2020-01-14', '2020-01-27'),
       ('Семенов И.В.', 'Москва', '700', '2020-01-23', '2020-01-31'),
       ('Ильиных Г.Р.', 'Владивосток', '450', '2020-01-12', '2020-02-02'),
       ('Колесов С.П.', 'Москва', '700', '2020-02-01', '2020-02-06'),
       ('Баранов П.Е.', 'Москва', '700', '2020-02-14', '2020-02-22'),
       ('Абрамова К.А.', 'Москва', '700', '2020-02-23', '2020-03-01'),
       ('Лебедев Т.К.', 'Москва', '700', '2020-03-03', '2020-03-06'),
       ('Колесов С.П.', 'Новосибирск', '450', '2020-02-27', '2020-03-12'),
       ('Семенов И.В.', 'Санкт-Петербург', '700', '2020-03-29', '2020-04-05'),
       ('Абрамова К.А.', 'Москва', '700', '2020-04-06', '2020-04-14'),
       ('Баранов П.Е.', 'Новосибирск', '450', '2020-04-18', '2020-05-04'),
       ('Лебедев Т.К.', 'Томск', '450', '2020-05-20', '2020-05-31'),
       ('Семенов И.В.', 'Санкт-Петербург', '700', '2020-06-01', '2020-06-03'),
       ('Абрамова К.А.', 'Санкт-Петербург', '700', '2020-05-28', '2020-06-04'),
       ('Федорова А.Ю.', 'Новосибирск', '450', '2020-05-25', '2020-06-04'),
       ('Колесов С.П.', 'Новосибирск', '450', '2020-06-03', '2020-06-12'),
       ('Федорова А.Ю.', 'Томск', '450', '2020-06-20', '2020-06-26'),
       ('Абрамова К.А.', 'Владивосток', '450', '2020-07-02', '2020-07-13'),
       ('Баранов П.Е.', 'Воронеж', '450', '2020-07-19', '2020-07-25');

 * postgresql://localhost:5432/postgres
Done.
Done.
20 rows affected.

[]

### Задание 1

Вывести из таблицы `trip` информацию о командировках тех сотрудников, фамилия которых заканчивается на букву «а», в отсортированном по убыванию даты последнего дня командировки виде. В результат включить столбцы `name`, `city`, `per_diem`, `date_first`, `date_last`.

Ключевые понятия:
- **MySQL**: RIGHT(), SUBSTRING_PART()
- **PostgreSQL**: RIGHT(), SPLIT_PART()

Вообще, эта задача решается через REGEX и `LIKE`, но для меня более привычное решение это:

```mysql
SELECT name, city, per_diem, date_first, date_last
FROM trip
WHERE RIGHT(SUBSTRING_INDEX(name, ' ', 1), 1) = 'а'
ORDER BY date_last DESC;
```

In [10]:
%%sql
SELECT name, city, per_diem, date_first, date_last
FROM stepik.trip
WHERE RIGHT(split_part(name, ' ', 1), 1) = 'а'
ORDER BY date_last DESC;

 * postgresql://localhost:5432/postgres
7 rows affected.

[('Абрамова К.А.', 'Владивосток', Decimal('450.00'), datetime.date(2020, 7, 2), datetime.date(2020, 7, 13)),
 ('Федорова А.Ю.', 'Томск', Decimal('450.00'), datetime.date(2020, 6, 20), datetime.date(2020, 6, 26)),
 ('Абрамова К.А.', 'Санкт-Петербург', Decimal('700.00'), datetime.date(2020, 5, 28), datetime.date(2020, 6, 4)),
 ('Федорова А.Ю.', 'Новосибирск', Decimal('450.00'), datetime.date(2020, 5, 25), datetime.date(2020, 6, 4)),
 ('Абрамова К.А.', 'Москва', Decimal('700.00'), datetime.date(2020, 4, 6), datetime.date(2020, 4, 14)),
 ('Абрамова К.А.', 'Москва', Decimal('700.00'), datetime.date(2020, 2, 23), datetime.date(2020, 3, 1)),
 ('Абрамова К.А.', 'Владивосток', Decimal('450.00'), datetime.date(2020, 1, 14), datetime.date(2020, 1, 27))]

### Задание 2
 
Вывести в алфавитном порядке фамилии и инициалы тех сотрудников, которые были в командировке в Москве.

Ключевые понятия:
- **MySQL**: SELECT DISTINCT, GROUP BY
- **PostgreSQL**: SELECT DISTINCT, GROUP BY

```mysql
SELECT DISTINCT name
FROM trip
WHERE city = 'Москва'
ORDER BY name ASC;
```

In [11]:
%%sql
SELECT DISTINCT name
FROM stepik.trip
WHERE city = 'Москва'
ORDER BY name ASC;

 * postgresql://localhost:5432/postgres
5 rows affected.

[('Абрамова К.А.',),
 ('Баранов П.Е.',),
 ('Колесов С.П.',),
 ('Лебедев Т.К.',),
 ('Семенов И.В.',)]

**Важно!**  
Тут стоит отметить такую вещь, как порядок сортировки кириллических букв в PostgreSQL именно на Mac OS (у меня 10.15.5). Использую UTF-8.
Как видно из примера выше, значение `Абрамова К.А.` оказалось в самом низу. Такое же поведение с буквами `е` и `ё` и в других случаях тоже. В итоге, сортировка работает некорректно. Это проблема не базы, а окружения. Правила сортировки для локали `ru_RU.UTF-8` в системе просто отсутствуют... Точнее файл LC_COLLATE, в котором должны храниться эти настройки, является символической ссылкой на файл из латинской локали. Более подробно читайте в [блоге](http://chipiga.pp.ua/sql/kak-zastavit-postgresql-pravilno-sortirovat-utf8-kirillitsu-na-mac-os-x/).

Чтобы окончательно разобраться, потребуется прилично времени, поэтому не будем останавливаться на этом, ведь это выходит за рамки данного конспекта. Единственное, используем временное решение в момент создания таблицы:
```sql
    name       text COLLATE "ru_RU",
    city       text COLLATE "ru_RU",
```
Таким образом мы решаем проблему с сортировкой букв, правда кроме буквы `ё`.

### Задание 3

Для каждого города посчитать, сколько раз сотрудники в нем были.  Информацию вывести в отсортированном в алфавитном порядке по названию городов. Вычисляемый столбец назвать `Количество`. 

Ключевые понятия:
- **MySQL**: count(), GROUP BY
- **PostgreSQL**: count(), GROUP BY

```sql
SELECT city, count(trip_id) AS Количество
FROM trip
GROUP BY city
ORDER BY city ASC;
```

In [12]:
%%sql
SELECT city, count(trip_id) AS Количество
FROM stepik.trip
GROUP BY city
ORDER BY city ASC;

 * postgresql://localhost:5432/postgres
6 rows affected.

[('Владивосток', 3),
 ('Воронеж', 1),
 ('Москва', 7),
 ('Новосибирск', 4),
 ('Санкт-Петербург', 3),
 ('Томск', 2)]

### Задание 4

Вывести два города, в которых чаще всего были в командировках сотрудники. Вычисляемый столбец назвать `Количество`.

Ключевые понятия:
- **MySQL**: LIMIT
- **PostgreSQL**: LIMIT
    
```sql
SELECT city, count(trip_id) AS Количество
FROM trip
GROUP BY city
ORDER BY Количество DESC
LIMIT 2;
```

In [13]:
%%sql
SELECT city, count(trip_id) AS Количество
FROM stepik.trip
GROUP BY city
ORDER BY Количество DESC
LIMIT 2;

 * postgresql://localhost:5432/postgres
2 rows affected.

[('Москва', 7), ('Новосибирск', 4)]

### Задание 5

Вывести информацию о командировках во все города кроме Москвы и Санкт-Петербурга (фамилии и инициалы сотрудников, город ,  длительность командировки в днях, при этом первый и последний день относится к периоду командировки). Информацию вывести в упорядоченном по убыванию длительности поездки, а потом по убыванию названий городов (в обратном алфавитном порядке).

Ключевые понятия:
- **MySQL**: datediff(), NOT IN
- **PostgreSQL**: вычитание дат, NOT IN

```sql
SELECT name, city, DATEDIFF(date_last, date_first) + 1 AS Длительность
FROM trip
WHERE city NOT IN ('Москва', 'Санкт-Петербург')
ORDER BY Длительность DESC, city DESC;
```

In [14]:
%%sql
SELECT name, city, date_last - date_first + 1 AS Длительность
FROM stepik.trip
WHERE city NOT IN ('Москва', 'Санкт-Петербург')
ORDER BY 3 DESC,
         1 DESC;

 * postgresql://localhost:5432/postgres
10 rows affected.

[('Ильиных Г.Р.', 'Владивосток', 22),
 ('Баранов П.Е.', 'Новосибирск', 17),
 ('Колесов С.П.', 'Новосибирск', 15),
 ('Абрамова К.А.', 'Владивосток', 14),
 ('Лебедев Т.К.', 'Томск', 12),
 ('Абрамова К.А.', 'Владивосток', 12),
 ('Федорова А.Ю.', 'Новосибирск', 11),
 ('Колесов С.П.', 'Новосибирск', 10),
 ('Федорова А.Ю.', 'Томск', 7),
 ('Баранов П.Е.', 'Воронеж', 7)]

### Задание 6

Вывести информацию о командировках сотрудника(ов), которые были самыми короткими по времени.

Ключевые понятия:
- **MySQL**: datediff(), min(), вложенный запрос
- **PostgreSQL**: вычитание дат, min(), вложенный запрос

```sql
SELECT name, city, date_first, date_last
FROM trip
WHERE datediff(date_last, date_first) = (SELECT MIN(datediff(date_last, date_first))
                                         FROM trip);
```

In [15]:
%%sql
SELECT name, city, date_first, date_last
FROM stepik.trip
WHERE (date_last - date_first) = (SELECT min(date_last - date_first)
                                  FROM stepik.trip);

 * postgresql://localhost:5432/postgres
1 rows affected.

[('Семенов И.В.', 'Санкт-Петербург', datetime.date(2020, 6, 1), datetime.date(2020, 6, 3))]

### Задание 7

Вывести информацию о командировках, начало и конец которых относятся к одному месяцу (год может быть любой). Результат отсортировать сначала  в алфавитном порядке по названию города, а затем по фамилии сотрудника.

Ключевые понятия:
- **MySQL**: month()
- **PostgreSQL**: extract(month from date)

```sql
SELECT name, city, date_first, date_last
FROM trip
WHERE MONTH(date_first) = MONTH(date_last)
ORDER BY 2 ASC, 1 ASC;
```

In [16]:
%%sql
SELECT name, city, date_first, date_last
FROM stepik.trip
WHERE extract(month from date_first) = extract(month from date_last)
ORDER BY 2 ASC, 1 ASC;

 * postgresql://localhost:5432/postgres
13 rows affected.

[('Абрамова К.А.', 'Владивосток', datetime.date(2020, 7, 2), datetime.date(2020, 7, 13)),
 ('Абрамова К.А.', 'Владивосток', datetime.date(2020, 1, 14), datetime.date(2020, 1, 27)),
 ('Баранов П.Е.', 'Воронеж', datetime.date(2020, 7, 19), datetime.date(2020, 7, 25)),
 ('Абрамова К.А.', 'Москва', datetime.date(2020, 4, 6), datetime.date(2020, 4, 14)),
 ('Баранов П.Е.', 'Москва', datetime.date(2020, 1, 12), datetime.date(2020, 1, 17)),
 ('Баранов П.Е.', 'Москва', datetime.date(2020, 2, 14), datetime.date(2020, 2, 22)),
 ('Колесов С.П.', 'Москва', datetime.date(2020, 2, 1), datetime.date(2020, 2, 6)),
 ('Лебедев Т.К.', 'Москва', datetime.date(2020, 3, 3), datetime.date(2020, 3, 6)),
 ('Семенов И.В.', 'Москва', datetime.date(2020, 1, 23), datetime.date(2020, 1, 31)),
 ('Колесов С.П.', 'Новосибирск', datetime.date(2020, 6, 3), datetime.date(2020, 6, 12)),
 ('Семенов И.В.', 'Санкт-Петербург', datetime.date(2020, 6, 1), datetime.date(2020, 6, 3)),
 ('Лебедев Т.К.', 'Томск', datetime.date(2020, 5, 20), datetime.date(2020, 5, 31)),
 ('Федорова А.Ю.', 'Томск', datetime.date(2020, 6, 20), datetime.date(2020, 6, 26))]

### Задание 8

Вывести название месяца и количество командировок для каждого месяца. Считаем, что командировка относится к некоторому месяцу, если она началась в этом месяце. Информацию вывести сначала в отсортированном по убыванию количества, а потом в алфавитном порядке по названию месяца виде. Название столбцов – Месяц и Количество.

Ключевые понятия:
- **MySQL**: monthname(date)
- **PostgreSQL**: to_char(date, 'Month')

```sql
SELECT monthname(date_first) AS Месяц,
       count(trip_id)    AS Количество
FROM trip
GROUP BY monthname(date_first)
ORDER BY Количество DESC,
         Месяц ASC;
```

In [17]:
%%sql
SELECT to_char(date_first, 'Month') AS месяц,
       count(trip_id)               AS количество
FROM stepik.trip
GROUP BY to_char(date_first, 'Month')
ORDER BY количество DESC,
         месяц ASC;

 * postgresql://localhost:5432/postgres
7 rows affected.

[('February ', 4),
 ('January  ', 4),
 ('June     ', 3),
 ('May      ', 3),
 ('April    ', 2),
 ('July     ', 2),
 ('March    ', 2)]

### Задание 9

Вывести сумму суточных (произведение количества дней командировки и размера суточных) для командировок, первый день которых пришелся на февраль или март 2020 года. Значение суточных для каждой командировки занесено в столбец  `per_diem`. Информацию отсортировать сначала  в алфавитном порядке по фамилиям сотрудников, а затем по убыванию суммы суточных.

Ключевые понятия:
- **MySQL**: datediff(), BETWEEN
- **PostgreSQL**: daterange, оператор приведения к типу `::` или же CAST(), вхождение множества `@>` 

```sql
SELECT name,
       city,
       date_first,
       (DATEDIFF(date_last, date_first) + 1) * per_diem AS Сумма
FROM trip
WHERE date_first BETWEEN '2020-02-01' AND '2020-03-31'
ORDER BY name ASC,
         Сумма DESC;
```

Данную задачу можно решить несколькими способами:
- `WHERE date_first >= '2020-02-01' AND date_first <= '2020-03-31'`
- `WHERE date_first BETWEEN '2020-02-01' AND '2020-03-31'`
- В Postgres воспользоваться daterange. См пример ниже.

In [18]:
%%sql
SELECT name,
       city,
       date_first,
       ((date_last - date_first) + 1) * per_diem AS Сумма
FROM stepik.trip
WHERE '[2020-02-01, 2020-03-31]'::daterange @> date_first
ORDER BY name ASC,
         Сумма DESC;

 * postgresql://localhost:5432/postgres
6 rows affected.

[('Абрамова К.А.', 'Москва', datetime.date(2020, 2, 23), Decimal('5600.00')),
 ('Баранов П.Е.', 'Москва', datetime.date(2020, 2, 14), Decimal('6300.00')),
 ('Колесов С.П.', 'Новосибирск', datetime.date(2020, 2, 27), Decimal('6750.00')),
 ('Колесов С.П.', 'Москва', datetime.date(2020, 2, 1), Decimal('4200.00')),
 ('Лебедев Т.К.', 'Москва', datetime.date(2020, 3, 3), Decimal('2800.00')),
 ('Семенов И.В.', 'Санкт-Петербург', datetime.date(2020, 3, 29), Decimal('5600.00'))]

### Задание 10

Вывести фамилию с инициалами и общую сумму суточных, полученных за все командировки для тех сотрудников, которые были в командировках больше чем 3 раза, в отсортированном по убыванию сумм суточных виде. Только для этого задания изменена строка таблицы `trip`:

`4	Ильиных Г.Р.	Владивосток	450	2020-01-12	2020-03-02`

Ключевые понятия:
- **MySQL**: 
- **PostgreSQL**: 

```sql
SELECT name,
       sum((datediff(date_last, date_first) + 1) * per_diem) AS Сумма
FROM trip
GROUP BY name
HAVING count(name) > 3
ORDER BY Сумма DESC;
```

In [19]:
%%sql
UPDATE stepik.trip
SET date_last = '2020-03-02' --old value: '2020-03-02'
WHERE trip_id = 4;

 * postgresql://localhost:5432/postgres
1 rows affected.

[]

In [20]:
%%sql
SELECT name,
       SUM(((date_last - trip.date_first) + 1) * per_diem) AS сумма
FROM stepik.trip
GROUP BY name
HAVING count(name) > 3
ORDER BY сумма DESC;

 * postgresql://localhost:5432/postgres
2 rows affected.

[('Абрамова К.А.', Decimal('29200.00')), ('Баранов П.Е.', Decimal('21300.00'))]